Repository: FlyingBird95/FlyingBird95.github.io
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: nl

source: English
nl: Engels

source: Dutch
nl: Nederlands

source: Your name
nl: Jouw naam

source: Your email
nl: Jouw email

source: Subject
nl: Onderwerp

source: Your message
nl: Jouw bericht

source: Send message
nl: Verstuur bericht

source: Thanks for contacting me
nl: Bedankt voor het contact

source: There are some errors. Please fix them below.
nl: Er zijn een aantal fouten. Corrigeer ze hieronder.

source: Your password
nl: Jouw wachtwoord

source: Username not found, or the given password is incorrect.
nl: Gebruikersnaam niet gevonden, of het opgegeven wachtwoord is incorrect.

source: Welcome
nl: Welkom

source: If you don't have an account, then you can
nl: Als je geen account hebt, dan kun je

source: register one here
nl: er hier een registeren

source: Forgot you password?
nl: Wachtwoord vergeten?

source: About
nl: Over mij

source: Resume
nl: Curriculum Vitae

source: Projects
nl: Projecten

source: My Blog
nl: Mijn Blog

source: This website is designed for engineering purposes. I use it to develop my programming skills and to learn new technologies. If you are interested into the source code, take a look
nl: Deze website is opgericht voor ontwikkelingsdoeleinden. Ik gebruik het om mijn eigen vaardigheden en programmeer skills te verbeteren en nieuwe technologieën te leren. Mocht je geïnteresseerd zijn in de broncode, neem dan een kijkje

source: here
nl: hier

source: Created by Patrick Vogel
nl: Gemaakt door Patrick Vogel

source: Hey! I am
nl: Hoi! Ik ben

source: I'm a
nl: Ik ben een

source: Software Engineer
nl: Software Ontwikkelaar

source: Basketball Player
nl: Basketbal Speler

source: Software Developer
nl: Software Ontwikkelaar

source: Basketball Coach
nl: Basketbal Coach

source: About Me
nl: Over mij

source: I am a professional Software Engineer working at
nl: Ik ben een professionele Software Ontwikkelaar, werkzaam bij

source: I'm specialized in Python web-development, and an expert in Django and Flask, for which I've developed the
nl: Ik ben gespecialiseerd in Python web-ontwikkeling. Ik ben een expert in Django en Flask. Hiervoor ontwikkelde ik het

source: Currently, I'm still the maintainer of this repository, and continuously adding new features.
nl: Momenteel ben ik nog steeds de persoon, die het project onderhoudt en nieuwe functionaliteit toevoegt.

source: October 14, 1995
nl: 14 oktober 1995

source: Download Resume
nl: Download CV

source: Education
nl: Onderwijs

source: Experience
nl: Ervaring

source: Skills
nl: Vaardigheden

source: Research
nl: Onderzoek

source: Pre-university education
nl: Voortgezet wetenschappelijk onderwijs

source: The school is located in Groningen. It is named after Heike Kamerlingh Onnes, who was a Dutch physicist and Nobel laureate. The school opened on September 26, 1864.
nl: De school bevindt zich in Groningen. Het is vernoemd naar Heike Kamerlingh Onnes, een Nederlandse natuurkundige en nobel prijswinnaar. De school is geopend op 26 september, 1864.

source: Bachelor Computing Science
nl: Bachelor Informatica

source: University of Groningen
nl: Rijksuniversiteit van Groningen

source: The University of Groningen was founded in 1614 and was was ranked 59th in the world, according to
nl: De Rijksuniversiteit van Groningen is opgericht in 1614 en staat geclassificeerd als de 59e beste universiteit van de wereld (in 2017) volgens

source: Academic Ranking of World Universities
nl: Academische ranking van alle universiteiten

source: I completed my Bachelors with a thesis about
nl: I heb mijn Bachelor afgerond met een scriptie over

source: Automatic Monitoring Python Web Services
nl: Automatisch toezicht houden van Python Web Services

source: Master Computing Science
nl: Master Informatica

source: Track: Software Engineering and Distributed Systems at the University of Groningen
nl: Track: Software Engineering en Gedistribueerde systemen aan de Rijksuniversiteit van Groningen

source: After I completed my Bachelors with an average grade of 8.1 (on a scale of 1-10) and a thesis grade of 9.5, I continued studying by doing my Masters at the University of Groningen. I've finished my Masters with a grade of 7.7 and a thesis about
nl: Nadat ik mijn Bachelor voltooid heb, met een gemiddeld cijfer van een 8,1 (op een schaal van 1-10) en een scriptie met een 9,5 heb afgrond, ben ik verder gegaan met studeren door het doen van mijn Master aan de Rijksuniversiteit van Groningen. Ik heb mijn Master afgerond met een cijfer van een 7,7 en een scriptie over

source: Teaching Assistant for Software Developer
nl: Onderwijsassistent voor Software Ontwerp

source: I have led a team of 8 people during a Software Engineering course, for a period of half a year. The work consisted of supervising, and helping them during the process of developing a large software project.
nl: Ik heb een team van 8 mensen tijdens een vak over Software Engineering begeleid, voor de duur van een half jaar. De taken bestonden uit het leiden en ondersteunen van het ontwikkelen van grootschalige software project.

source: Currently, I'm a Software Engineer at See Tickets Benelux. They are one of the leaders in the global ticketing market, with a strong presence in the United States and Europe. My work consists of maintaining the Python Platform. This platform uses frameworks like Django, Flask and SQLAlchemy. The focus of their platform is code quality, which is supported by exhausting testing implemented by specialized test-frameworks.
nl: Momenteel ben ik een Software Ontwikkelaar bij See Tickets Benelux. Zij zijn een van de grootste op het gebied van online kaart verkoop, met een sterke aanwezigheid in Amerika en Europa. Mijn dagelijkse taken bestaan uit het onderhouden van het Python Platform. Dit platform gebruikt technologieën zoals Django, Flask en SQLAlchemy. Ze richten zich op code van goede kwaliteit, wat geholpen wordt door uitgebreide testen, die gemaakt zijn in gespecialiseerde test-frameworks.

source: Tens of thousands of web applications are written in Flask, a Python-based web framework. Despite a rich ecosystem of extensions, there is none that supports the developer in gaining insight into the evolving performance of their service. In this paper, we introduce Flask Dashboard, a library that addresses this problem. We present the ease with which the library can be integrated in an already existing web application, discuss some of the visualization perspectives that the library provides and point to some future challenges for similar libraries.
nl: Tienduizenden webapplicaties zijn geschreven met Flask, een op Python gebaseerd web framework. Ondanks zijn rijke ecosysteem vol met uitbreidingen, is er geen een dat de ontwikkelaar ondersteund in het inzichtelijk maken van de veranderde prestaties van zijn gebruik. In dit artikel wordt de Flask Dashboard geïntroduceerd, dat ontworpen is om dit probleem te addresseren. We presenteren het gemak waarmee het systeem gebruikt kan worden in een bestaande web applicatie. Daarnaast discussiëren we een aantal visuale perspectieven, die mogelijk gemaakt worden door het systeem en wijzen we een aantal verbeterpunten aan voor vergelijkbare systemen.

source: Authors
nl: Auteurs

source: Download here
nl: Download hier

source: Bachelor's Thesis
nl: Bachelor Scriptie

source: A Dashboard for Automatic Monitoring Python Web Services
nl: Een dashboard voor het automatisch monitoring van Python web services

source: This bachelor thesis describes the problem of monitoring the performance of Flask-based Python web-services. For the web developer that wants to monitor the performance for their web-services, a solution is presented. The solution consists of an automatic monitoring dashboard, that can be installed in any existing web-service with Python and Flask. After the installation (installation requires 2 lines of code) an automatic monitoring service is ready to use. With several lines of extra configuration, the following features are supported: - Automatic version detection. The monitoring tool detects the active version of this VCS and combines this with the collected data. - Comparison of execution times across different users. Which users perform better or worse on certain versions of the system and how can this be improved? The monitoring dashboard creates graphs automatically, wherein it is easy to spot differences in execution times. - Automatic outlier detection. Whenever the execution time is larger than usual -- an outlier --, the monitoring tool collects extra information about the requested data, such as the stack-trace of active threads, and CPU- and memory usage of the system. In order to reduce the overhead of the dashboard, logging extra information is only done for potential outliers. Moreover, this thesis describes the design of the monitoring tool. After the development of the dashboard, it is deployed for a case study to validate its usefulness. The collected results have been used to analyze and improve the performance of that case study.
nl: Deze Bachelor thesis beschrijft het probleem dat onstaat bij het monitoren van de prestaties van op Flask-gebaseerde Python web-services. Een oplossing wordt gepresenteerd voor de ontwikkelaar die graag zijn prestaties wil monitoring. Deze oplossing bestaat uit een geautomatiseerd monitorings-dashboard, dat gemakkelijk geinstalleerd kan worden in elke bestaande web-service met Python en Flask. Na de installatie (de installatie zelf neemt maar 2 regels code in beslag), is de geautomatiseerde monitoring service klaar voor gebruikt. Met een aantal regels code meer voor de configuratie, kunnen de volgende kenmerken worden gebruikt: - Automatische versie detectie. Het monitorings systeem detecteert de huidige versie vanuit zijn VCS (Version Control System) en combineert deze informatie met de verzamelde data. - Het vergelijken van de uitvoeringstijden over meerdere gebruikers. Welke gebruikers laten een betere, of slechtere, prestatie zien over de verschillende versies van het systeem, en hoe kan dit verbeterd worden? Het monitorings dashboard genereert een aantal grafieken automatisch, waar de verschillen makkelijk zichtbaar worden. - Automatische uitschieter detectie. Wanneer de uitvoeringstijd significant groter is dan gebruiker — dit wordt een uitschieter genoemd — zal de monitoring applicatie zelf extra informatie verzamelen over de opgevraagde data, zoals de lijn tracering van de actieve threads, CPU- en geheugen gebruik van het systeem. Om de overhead van het dashboard te verminderen, wordt het verzamelen van deze informatie alleen gedaan voor potentiële uitschieters. Daarnaast, beschrijft deze thesis het ontwerp van het monitoring systeem. Na de implementatie fase van het programma, is het uitgevoerd in een case studie, waardoor zijn bruikbaarheid gevalideerd kan worden. De verzamelde resultaten worden gebruikt om het systeem verder te analyseren en te verbeteren waar nodig.

source: Author
nl: Auteur

source: Master's Thesis
nl: Master Scriptie

source: A key feature of Cloud Computing is to pay proportionally for requested resources. Monitoring is thus essential to finding out the actual resource usage of components. However, existing Cloud Monitoring Solutions are not capable of estimating the operational cost. As such, Cloud Consumers have to rely to the billing provided by the Cloud Provider instead, that is, only deal with cost after the fact. Our research proposes a model which monitors the deployment cost of a containerized Cloud-based Application while it is running, and estimates the waste caused by unused resources provisioned to the application. We introduce an efficient and effective Cloud Monitoring Solution using this model towards allowing for cost optimization on deployment level. We verify this solution by deploying it on an industrial Cloud System.
nl: Een belangrijk kenmerk van Cloud Computing is evenredig te betalen voor de gebruikte middelen. Het monitoren van deze systemen is daarom noodzakelijk om het huidige gebruikt van de componenten te bepalen. Maar, bestaande monitoring systemen voor Cloud Computing zijn vaak niet in staat om dit operationele kosten in te schatten. Als gevolg hiervan moeten gebruikers van de Cloud vertrouwen op de berekende kosten door de Cloud leverancier. Dit kan pas achteraf bepaald worden. Ons onderzoek richt zich op het ontwikkelen van een model waarin toezicht gehouden wordt op de kosten van een gecontaineriseerd, op de Cloud gebaseerde applicatie terwijl het uitvoerend is. Hierdoor ontstaat een schatting van de kosten die weg gegooid worden door niet gebruikte componenten. We introduceren een efficiënt en effectieve oplossing door gebruik te maken van het model dat zicht richt op het berekenen van deze kosten tijdens het uitvoeren van het systeem. De oplossing wordt getest in een bestaande Cloud applicatie.

source: My Project
nl: Mijn Project

source: In the past years, I've developed several small projects. However, only the Flask-Monitoring Dashboard is worth mentioning. It is an extension for Flask applications that offers four main functionalities with little effort from the Flask developer:
nl: In de afgelopen jaren heb ik een aantal kleine projecten ontworpen. Alleen de Flask-Monitoring Dashboard is waard om te beschrijven. Het is een uitbreiding voor Flask applicaties that 4 grote functionaliteiten biedt voor weinig moeite van de Flask ontwikkelaar:

source: Monitor the performance and utilization:
nl: Monitor de prestatie en gebruik:

source: The Dashboard allows you to see which endpoints process a lot of requests and how fast. Additionally, it provides information about the evolving performance of an endpoint throughout different versions if you're using git.
nl: Het dashboard staat je toe om te zien welke endpoints veel vragen verwerken en hoe snel ze dit doen. Daarnaast, biedt het informatie over de veranderende prestaties van een endpoint door verschillende versies als je git gebruikt.

source: Profile requests and endpoints:
nl: Profileren van requests en endpoints:

source: The execution path of every request is tracked and stored into the database. This allows you to gain insight over which functions in your code take the most time to execute. Since all requests for an endpoint are also merged together, the Dashboard provides an overview of which functions are used in which endpoint.
nl: De uitvoeringscode van elke request wordt opgeslagen in de database. Dit geeft inzicht over welke functies in de code de meeste tijd kosten om uit te voeren. Doordat alle requests voor een endpoint ook samengevoegd worden, krijgt het dashboard een overzicht van welke functies veel gebruikt worden in welke endpoint.

source: Collect extra information about outliers:
nl: Verzamel meer informatie over outliers:

source: Outliers are requests that take much longer to process than regular requests. The Dashboard automatically detects that a request is an outlier and stores extra information about it (stack trace, request values, Request headers, Request environment).
nl: Outliers zijn requests die veel langer duren om te verwerken dan gebruikelijke requests. Het dashboard detecteert automatisch of een request een outlier en verzameld er dan meer informatie over (stack trace, request waardes, request headers, request omgeving).

source: Collect additional information about your Flask-application:
nl: Verzamel extra informatie over je Flask-applicatie:

source: Suppose you have an User-table and you want to know how many users are registered on your Flask-application. Then, you can run the following query:
nl: Stel dat je een User-tabel hebt en je wil weten hoeveel gebruikers zich registeren voor je Flask applicatie. Dan kan je de volgende query uitvoeren:

source: But this is just annoying to do regularly. Therefore, you can configure this in the Flask-MonitoringDashboard, which will provide you this information per day (or other time interval).
nl: Maar dit is juist vervelend om dit vaak te doen. Daarom, kan je dit configureren in de Flask-MonitoringDashboard, zodat dit de juiste informatie verzameld per dag (of per ander tijdsinterval).

source: Stars on Github
nl: Sterren op Github

source: Downloads every day
nl: Downloads per dag

source: My blog is still under development. Don't expect too much form it.
nl: Mijn blog is nog onder ontwikkeling. Verwacht er niet te veel van.

source: I'm
nl: Ik ben

source: available
nl: beschikbaar

source: for projects
nl: voor projecten

source: I will accept any project that seems interesting to me. Usually, I'll do it for free!
nl: Ik sta open voor elk project dat me interessant lijkt. Normaal gesproken doe ik het gratis!

source: Contact me
nl: Contacteer me

source: Contact Me
nl: Contacteer Me

source: You can reach me using one of the buttons below, or fill in the form below the buttons.
nl: Je kan me bereiken door één van onderstaande knoppen, of het formulier daaronder in te vullen.

source: Email Address
nl: Email-adres

source: See my LinkedIn profile
nl: Zie mijn LinkedIn profiel

source: See my Github profile
nl: Zie mijn Github pagina
